Repository: SURIYA-8273/furniture_invoice
Catalog: lib/l10n/app_*.arb
Languages: ta

# appName
source: Furniture Billing
ta: மரச்சாமான் பில்லிங்

# appSubtitle
source: Production-Ready Billing Software
ta: உற்பத்தி-தயார் பில்லிங் மென்பொருள்

source: Home
ta: முகப்பு

source: Customers
ta: வாடிக்கையாளர்கள்

source: Add Customer
ta: வாடிக்கையாளரைச் சேர்

source: Edit Customer
ta: வாடிக்கையாளரைத் திருத்து

source: Customer Name
ta: வாடிக்கையாளர் பெயர்

source: Enter customer name
ta: வாடிக்கையாளர் பெயரை உள்ளிடவும்

source: Phone Number
ta: தொலைபேசி எண்

source: Email
ta: மின்னஞ்சல்

source: Address
ta: முகவரி

source: Balance
ta: இருப்பு

# searchCustomers
source: Search customers by name or phone
ta: பெயர் அல்லது தொலைபேசி எண்ணால் தேடுங்கள்

source: No customers found
ta: வாடிக்கையாளர்கள் இல்லை

# addFirstCustomer
source: Add your first customer to get started
ta: தொடங்க உங்கள் முதல் வாடிக்கையாளரைச் சேர்க்கவும்

source: Retry
ta: மீண்டும் முயற்சி செய்

source: Products
ta: பொருட்கள்

source: Billing
ta: பில்லிங்

source: Invoices
ta: விலைப்பட்டியல்கள்

source: Payments
ta: பணம் செலுத்துதல்

source: Reports
ta: அறிக்கைகள்

source: Settings
ta: அமைப்புகள்

source: Business Profile
ta: வணிக விவரம்

source: Add
ta: சேர்

source: Edit
ta: திருத்து

source: Delete
ta: நீக்கு

source: Save
ta: சேமி

source: Cancel
ta: ரத்து செய்

source: Search
ta: தேடு

source: Filter
ta: வடிகட்டு

source: Export
ta: ஏற்றுமதி

source: Print
ta: அச்சிடு

source: Share
ta: பகிர்

# customerPhone
source: Phone Number
ta: தொலைபேசி எண்

# customerAddress
source: Address
ta: முகவரி

# customerBalance
source: Balance
ta: நிலுவை

source: Customer Details
ta: வாடிக்கையாளர் விவரங்கள்

source: Customer List
ta: வாடிக்கையாளர் பட்டியல்

source: Item Name
ta: பெயர்

source: Product Name
ta: பொருளின் பெயர்

# productPrice
source: Price
ta: விலை

# productSize
source: Size
ta: அளவு

source: Add Product
ta: பொருளைச் சேர்

source: Edit Product
ta: பொருளைத் திருத்து

source: Update Product
ta: பொருளைப் புதுப்பி

source: Delete Product
ta: பொருளை நீக்கு

source: Product List
ta: பொருள் பட்டியல்

# searchProducts
source: Search products by name
ta: பெயரால் பொருட்களைத் தேடுங்கள்

source: No products found
ta: பொருட்கள் இல்லை

# addYourFirstProduct
source: Add your first product to get started
ta: தொடங்க உங்கள் முதல் பொருளைச் சேர்க்கவும்

source: Size
ta: அளவு

source: Description
ta: விவரம்

source: Descriptions
ta: விவரங்கள்

source: Manage Descriptions
ta: விவரங்களை நிர்வகி

source: Add Description
ta: விவரம் சேர்

source: Edit Description
ta: விவரத்தைத் திருத்து

source: Delete Description
ta: விவரத்தை நீக்கு

# noDescriptionsYet
source: No descriptions added yet
ta: இன்னும் விவரங்கள் சேர்க்கப்படவில்லை

source: Enter description text
ta: விவர உரையை உள்ளிடவும்

# deleteDescriptionConfirmation
source: Are you sure you want to delete "{text}"?
ta: "{text}" ஐ நிச்சயமாக நீக்க விரும்புகிறீர்களா?

source: Category
ta: வகை

source: Enter product name
ta: பொருளின் பெயரை உள்ளிடவும்

source: Enter description
ta: விவரத்தை உள்ளிடவும்

source: Enter MRP
ta: விலையை உள்ளிடவும்

# enterSize
source: Enter size (e.g., 3×5, 4×6)
ta: அளவை உள்ளிடவும் (எ.கா., 3×5, 4×6)

source: Enter category
ta: வகையை உள்ளிடவும்

# productNameRequired
source: Product name is required
ta: பொருளின் பெயர் தேவை

# rateRequired
source: Rate is required
ta: விலை தேவை

# invalidMRP
source: Invalid MRP. Must be greater than 0
ta: தவறான விலை. 0 விட அதிகமாக இருக்க வேண்டும்

source: Product added successfully
ta: பொருள் வெற்றிகரமாக சேர்க்கப்பட்டது

source: Product updated successfully
ta: பொருள் வெற்றிகரமாக புதுப்பிக்கப்பட்டது

source: Product deleted successfully
ta: பொருள் வெற்றிகரமாக நீக்கப்பட்டது

source: Error saving product
ta: பொருளைச் சேமிப்பதில் பிழை

source: Error deleting product
ta: பொருளை நீக்குவதில் பிழை

# deleteProductConfirmation
source: Are you sure you want to delete this product?
ta: இந்த பொருளை நிச்சயமாக நீக்க விரும்புகிறீர்களா?

source: Invoice Number
ta: விலைப்பட்டியல் எண்

source: Invoice Date
ta: விலைப்பட்டியல் தேதி

# invoiceTotal
source: Total Amount
ta: மொத்த தொகை

# invoiceStatus
source: Status
ta: நிலை

source: Create Invoice
ta: விலைப்பட்டியல் உருவாக்கு

source: Invoice Details
ta: விலைப்பட்டியல் விவரங்கள்

# serialNumber
source: S.No
ta: வ.எண்

source: Quantity
ta: அளவு

# length
source: LEN
ta: நீளம்

source: Total Length
ta: மொத்த நீளம்

source: RATE
ta: விலை

source: Amount
ta: தொகை

source: Total Amount
ta: மொத்த தொகை

source: Subtotal
ta: துணை மொத்தம்

source: Discount
ta: தள்ளுபடி

source: Grand Total
ta: மொத்தம்

source: Paid Amount
ta: செலுத்தப்பட்ட தொகை

source: Balance Amount
ta: மீதி தொகை

source: REMAINING BALANCE
ta: மீதமுள்ள நிலுவை

# editBillAndPayment
source: Edit Bill & Payment
ta: பில் & பணம் செலுத்துதலைத் திருத்து

source: Payment History
ta: கட்டண வரலாறு

source: No previous payments
ta: முந்தைய பணம் செலுத்துதல் இல்லை

source: Enter Payment Amount
ta: பணம் செலுத்தும் தொகையை உள்ளிடவும்

source: Update Payment
ta: பணம் செலுத்துதலைப் புதுப்பி

# paymentUpdatedSuccessfully
source: Payment updated and saved successfully!
ta: பணம் செலுத்துதல் புதுப்பிக்கப்பட்டு சேமிக்கப்பட்டது!

source: Share Invoice
ta: பில் பகிர்

source: WhatsApp Number (Optional)
ta: வாட்ஸ்அப் எண் (விருப்பமானது)

source: Send
ta: அனுப்பு

source: Business Profile Missing
ta: வணிக சுயவிவரம் இல்லை

# businessProfileSetupMessage
source: Please set up your business profile (Name, Address, Logo) in Settings before generating invoices.
ta: பில் உருவாக்கும் முன் அமைப்புகளில் உங்கள் வணிக சுயவிவரத்தை (பெயர், முகவரி, லோகோ) அமைக்கவும்.

source: Business Name (Tamil)
ta: வணிக பெயர் (தமிழ்)

# businessAddressTamil
source: Address (Tamil)
ta: முகவரி (தமிழ்)

source: Select Language
ta: மொழியைத் தேர்ந்தெடுக்கவும்

source: Language Selection
ta: மொழி தேர்வு

# pdfGeneratedAt
source: PDF Generated at {path}
ta: PDF உருவாக்கப்பட்டது: {path}

source: Invoice Preview
ta: பில் முன்னோட்டம்

source: Share via WhatsApp
ta: வாட்ஸ்அப் வழியாக பகிர்

source: BACK TO DASHBOARD
ta: டாஷ்போர்டுக்கு திரும்பு

source: NEW BILL
ta: புதிய பில்

source: Generate Bill
ta: பில் உருவாக்கு

source: All data cleared
ta: அனைத்து தரவும் அழிக்கப்பட்டது

# pleaseAddItems
source: Please add at least one item to the bill
ta: பில்லில் குறைந்தது ஒரு பொருளையாவது சேர்க்கவும்

source: ADD ITEM
ta: உருப்படி சேர்

source: NEXT
ta: அடுத்து

source: Balance Due
ta: நிலுவை

source: Desc
ta: விவரம்

source: No items added
ta: பொருட்கள் எதுவும் சேர்க்கப்படவில்லை

# clearAllDataQuestion
source: Clear All Data?
ta: அனைத்து தரவையும் அழிக்கவா?

# clearAllDataWarning
source: This will reset all billing items and payment details. This action cannot be undone.
ta: இது அனைத்து பில்லிங் பொருட்கள் மற்றும் கட்டண விவரங்களை மீட்டமைக்கும். இந்த செயலை செயல்தவிர்க்க முடியாது.

# clearAllAction
source: Clear All
ta: அனைத்தையும் அழி

source: Payment Mode
ta: பணம் செலுத்தும் முறை

source: Payment Date
ta: பணம் செலுத்திய தேதி

source: Payment Amount
ta: பணம் செலுத்திய தொகை

source: Record Payment
ta: பணம் செலுத்துதலைப் பதிவு செய்

source: Partial Payment
ta: பகுதி பணம்

source: Full Payment
ta: முழு பணம்

source: Pending Dues
ta: நிலுவை தொகை

source: Cash
ta: பணம்

source: Card
ta: அட்டை

source: UPI
ta: யூபிஐ

source: Bank Transfer
ta: வங்கி பரிமாற்றம்

source: Cheque
ta: காசோலை

source: Daily Report
ta: தினசரி அறிக்கை

source: Weekly Report
ta: வாராந்திர அறிக்கை

source: Monthly Report
ta: மாதாந்திர அறிக்கை

source: Custom Report
ta: தனிப்பயன் அறிக்கை

source: Total Sales
ta: மொத்த விற்பனை

source: Total Paid
ta: மொத்த செலுத்தப்பட்டது

source: Total Pending
ta: மொத்த நிலுவை

source: Customer-wise Due
ta: வாடிக்கையாளர் வாரியாக நிலுவை

source: Product-wise Sales
ta: பொருள் வாரியாக விற்பனை

source: Date Range
ta: தேதி வரம்பு

source: From
ta: இருந்து

source: To
ta: வரை

source: Business Name
ta: வணிக பெயர்

source: Business Logo
ta: வணிக சின்னம்

source: WhatsApp Number
ta: வாட்ஸ்அப் எண்

source: Primary Phone
ta: முதன்மை தொலைபேசி

source: Additional Phone
ta: கூடுதல் தொலைபேசி

source: Instagram ID
ta: இன்ஸ்டாகிராம் ஐடி

source: Website URL
ta: இணையதள முகவரி

source: GST Number
ta: ஜிஎஸ்டி எண்

source: Business Address
ta: வணிக முகவரி

source: Upload Logo
ta: சின்னத்தைப் பதிவேற்று

source: Optional
ta: விரும்பினால்

source: Required
ta: தேவையானது

source: Theme
ta: தீம்

source: Light Theme
ta: வெளிச்ச தீம்

source: Dark Theme
ta: இருண்ட தீம்

source: Language
ta: மொழி

source: English
ta: ஆங்கிலம்

source: Tamil
ta: தமிழ்

source: Backup
ta: காப்புப்பிரதி

source: Restore
ta: மீட்டமை

source: Cloud Backup
ta: கிளவுட் காப்புப்பிரதி

source: Drive Backup
ta: டிரைவ் காப்புப்பிரதி

# lastBackup
source: Last backup: {time}
ta: கடைசி காப்புப்பிரதி: {time}

source: Backup Now
ta: இப்போது காப்புப்பிரதி எடு

source: Restore from Backup
ta: காப்புப்பிரதியிலிருந்து மீட்டமை

source: General
ta: பொது

source: Dark Mode Enabled
ta: இருண்ட பயன்முறை இயக்கப்பட்டது

source: Light Mode Enabled
ta: வெளிச்ச பயன்முறை இயக்கப்பட்டது

source: Business
ta: வணிகம்

# manageBusinessDetails
source: Manage your business details
ta: உங்கள் வணிக விவரங்களை நிர்வகிக்கவும்

source: Data
ta: தரவு

source: Backup your data
ta: உங்கள் தரவை காப்புப்பிரதி எடுக்கவும்

source: Backup feature coming soon
ta: காப்புப்பிரதி அம்சம் விரைவில் வரும்

source: Restore feature coming soon
ta: மீட்டமை அம்சம் விரைவில் வரும்

source: About
ta: பற்றி

source: Version
ta: பதிப்பு

# backupSettings
source: Backup & Restore
ta: காப்புப்பிரதி அமைப்புகள்

# connectionStatus
source: Cloud Connection
ta: இணைப்பு நிலை

# connectedToSupabase
source: Connected to Cloud
ta: சப்போபேஸுடன் இணைக்கப்பட்டுள்ளது

source: Not connected
ta: இணைக்கப்படவில்லை

# supabaseNotConfigured
source: Cloud Backup Not Configured
ta: சப்போபேஸ் உள்ளமைக்கப்படவில்லை

source: Test Connection
ta: இணைப்பைச் சோதிக்கவும்

# manualBackup
source: Manual Cloud Backup
ta: கைமுறை காப்புப்பிரதி

# manualBackupDescription
source: Backup your bills and payment data to the secure cloud manually.
ta: உங்கள் பில்கள் மற்றும் கட்டணத் தரவை மேகக்கணியில் கைமுறையாக காப்புப்பிரதி எடுக்கவும்.

# automaticBackup
source: Automatic Cloud Backup
ta: தானியங்கி காப்புப்பிரதி

# automaticBackupDescription
source: Your data is automatically backed up to the cloud daily at 12:00 AM.
ta: உங்கள் தரவு தினமும் இரவு 12:00 மணிக்கு தானாகவே காப்புப்பிரதி எடுக்கப்படும்.

source: Enable Automatic Backup
ta: தானியங்கி காப்புப்பிரதியை இயக்கு

source: Backup Time
ta: காப்புப்பிரதி நேரம்

source: Daily Backup Time
ta: தினசரி காப்புப்பிரதி நேரம்

# lastImport
source: Last restore: {time}
ta: கடைசி இறக்குமதி: {time}

# automaticImport
source: Automatic Restore
ta: தானியங்கி இறக்குமதி

# automaticImportDescription
source: Your data is automatically restored from the cloud daily at 1:00 AM.
ta: உங்கள் தரவு தினமும் காலை 1:00 மணிக்கு தானாகவே இறக்குமதி செய்யப்படும்.

# enableAutomaticImport
source: Enable Automatic Restore
ta: தானியங்கி இறக்குமதியை இயக்கு

# dailyImportTime
source: Daily Restore Time
ta: தினசரி இறக்குமதி நேரம்

# aboutImport
source: About Restore
ta: இறக்குமதி பற்றி

# aboutImportDescription
source: Data is automatically restored from the cloud to ensure all devices are in sync.
ta: எல்லா சாதனங்களும் ஒத்திசைவில் இருப்பதை உறுதிசெய்ய மேகக்கணியிலிருந்து தரவு தானாகவே மீட்டமைக்கப்படுகிறது.

source: About Backups
ta: காப்புப்பிரதிகள் பற்றி

# aboutBackupsDescription
source: Your data is securely backed up to cloud storage. Both new and updated bills are automatically synced.
ta: உங்கள் தரவு சப்போபேஸ் கிளவுட் ஸ்டோரேஜில் பாதுகாப்பாக காப்புப்பிரதி எடுக்கப்படுகிறது. புதிய மற்றும் புதுப்பிக்கப்பட்ட பில்கள் தானாகவே ஒத்திசைக்கப்படுகின்றன.

source: Starting backup...
ta: காப்புப்பிரதி தொடங்குகிறது...

source: Backup Successful
ta: காப்புப்பிரதி வெற்றி

# dataBackedUpSuccessfully
source: Your data has been backed up successfully!
ta: உங்கள் தரவு வெற்றிகரமாக காப்புப்பிரதி எடுக்கப்பட்டது!

source: Bills synced:
ta: ஒத்திசைக்கப்பட்ட பில்கள்:

source: Bills failed:
ta: தோல்வியடைந்த பில்கள்:

source: Payments synced:
ta: ஒத்திசைக்கப்பட்ட கட்டணங்கள்:

source: Payments failed:
ta: தோல்வியடைந்த கட்டணங்கள்:

source: OK
ta: சரி

# importFromSupabase
source: Restore from Cloud
ta: சப்போபேஸிலிருந்து இறக்குமதி செய்க

# importFromSupabaseDescription
source: Fetch all bills and payments from the cloud and save them locally.
ta: சப்போபேஸிலிருந்து அனைத்து பில்கள் மற்றும் கட்டணங்களைப் பெற்று உள்ளூரில் சேமிக்கவும்.

# importNow
source: Restore Now
ta: இப்போது இறக்குமதி செய்

# importFromCloudConfirmTitle
source: Restore from Cloud?
ta: மேகக்கணியிலிருந்து இறக்குமதி செய்யவா?

# importFromCloudConfirmMessage
source: This will fetch all data from the cloud and merge it with your local data.
ta: இது சப்போபேஸிலிருந்து அனைத்து பில்கள் மற்றும் கட்டணங்களைப் பெற்று உங்கள் உள்ளூர் தரவுகளுடன் இணைக்கும். ஒரே ஐடியைக் கொண்ட பதிவுகள் புதுப்பிக்கப்படும்.

# importSuccessful
source: Restore Successful
ta: இறக்குமதி வெற்றி

# dataImportedSuccessfully
source: Data successfully restored from cloud.
ta: சப்போபேஸிலிருந்து தரவு வெற்றிகரமாக இறக்குமதி செய்யப்பட்டது.

source: Bills Restored
ta: மீட்டெடுக்கப்பட்ட பில்கள்

source: Payments Restored
ta: மீட்டெடுக்கப்பட்ட கட்டணங்கள்

# importFailed
source: Restore Failed
ta: இறக்குமதி தோல்வி

# importError
source: Restore Error
ta: இறக்குமதி பிழை

# backupToCloudConfirmTitle
source: Backup to Cloud?
ta: மேகக்கணியில் காப்புப்பிரதி எடுக்கவா?

# backupToCloudConfirmMessage
source: This will backup all your data to the cloud.
ta: இது உங்கள் எல்லாத் தரவையும் மேகக்கணியில் காப்புப்பிரதி எடுக்கும்.

# exitConfirmationTitle
source: Exit?
ta: வெளியேறவா?

# exitConfirmationMessage
source: Are you sure you want to go back?
ta: நிச்சயமாக திரும்பிச் செல்ல விரும்புகிறீர்களா?

source: Exit App?
ta: பயன்பாட்டிலிருந்து வெளியேறவா?

# exitAppConfirmation
source: Are you sure you want to exit the application?
ta: நிச்சயமாக பயன்பாட்டிலிருந்து வெளியேற விரும்புகிறீர்களா?

source: Exit
ta: வெளியேறு

# connectedSuccessfully
source: Connected successfully ({latency}ms)
ta: வெற்றிகரமாக இணைக்கப்பட்டது ({latency}ms)

# connectionFailed
source: Connection failed: {message}
ta: இணைப்பு தோல்வி: {message}

source: Backup Failed
ta: காப்புப்பிரதி தோல்வி

source: Backup Error
ta: காப்புப்பிரதி பிழை

source: Generate PDF
ta: பிடிஎஃப் உருவாக்கு

source: Share on WhatsApp
ta: வாட்ஸ்அப்பில் பகிர்

# customerDetailsRequired
source: Customer details required to generate PDF
ta: பிடிஎஃப் உருவாக்க வாடிக்கையாளர் விவரங்கள் தேவை

# pleaseProvideCustomerDetails
source: Please provide customer name, address, and phone number
ta: வாடிக்கையாளர் பெயர், முகவரி மற்றும் தொலைபேசி எண்ணை வழங்கவும்

# validationRequired
source: This field is required
ta: இந்த புலம் தேவையானது

# validationMinLength
source: Minimum {length} characters required
ta: குறைந்தபட்சம் {length} எழுத்துக்கள் தேவை

# validationInvalidPhone
source: Invalid phone number
ta: தவறான தொலைபேசி எண்

# validationInvalidEmail
source: Invalid email address
ta: தவறான மின்னஞ்சல் முகவரி

# validationInvalidUrl
source: Invalid URL
ta: தவறான இணையதள முகவரி

# validationInvalidGst
source: Invalid GST number
ta: தவறான ஜிஎஸ்டி எண்

source: Success
ta: வெற்றி

source: Error
ta: பிழை

source: Warning
ta: எச்சரிக்கை

source: Info
ta: தகவல்

# confirmDelete
source: Are you sure you want to delete?
ta: நிச்சயமாக நீக்க விரும்புகிறீர்களா?

source: Yes
ta: ஆம்

source: No
ta: இல்லை

source: No data found
ta: தரவு எதுவும் இல்லை

source: Loading...
ta: ஏற்றுகிறது...

source: Close
ta: மூடு

source: Sales Summary
ta: விற்பனை சுருக்கம்

source: Recent Invoices
ta: சமீபத்திய விலைப்பட்டியல்கள்

source: Today
ta: இன்று

source: This Week
ta: இந்த வாரம்

source: This Month
ta: இந்த மாதம்

source: Custom
ta: தனிப்பயன்

source: Total Bills
ta: மொத்த பில்கள்

source: Unpaid Bills
ta: செலுத்தப்படாத பில்கள்

# noReportsData
source: No data available for the selected period
ta: தேர்ந்தெடுக்கப்பட்ட காலத்திற்கு தரவு இல்லை

source: Paid
ta: செலுத்தப்பட்டது

source: Unpaid
ta: செலுத்தப்படவில்லை

source: Partially Paid
ta: பகுதி செலுத்தப்பட்டது

source: CLEAR ALL
ta: அனைத்தையும் அழி

# clearAllConfirmation
source: Are you sure you want to clear all items?
ta: நிச்சயமாக அனைத்து உருப்படிகளையும் அழிக்க விரும்புகிறீர்களா?

source: Tap + to add items
ta: உருப்படிகளைச் சேர்க்க + தட்டவும்

source: Width
ta: அகலம்

source: Height
ta: உயரம்

# deleteItemConfirmation
source: Are you sure you want to delete this item?
ta: இந்த உருப்படியை நிச்சயமாக நீக்க விரும்புகிறீர்களா?

source: BILL NO
ta: பில் எண்

source: DATE
ta: தேதி

# customer
source: CUS
ta: வாடிக்

source: TOTAL
ta: மொத்தம்

source: DUE
ta: நிலுவை

source: Bill Payments
ta: பில் பணம் செலுத்துதல்

source: Unpaid/Partial
ta: செலுத்தப்படாதது/பகுதி

source: Search bill number
ta: பில் எண்ணால் தேடுங்கள்

source: No invoices found
ta: விலைப்பட்டியல்கள் இல்லை

source: Delete Bill
ta: பில்லை நீக்கு

# deleteBillConfirmation
source: Are you sure you want to delete Bill #{number}? This action cannot be undone.
ta: பில் #{number} ஐ நிச்சயமாக நீக்க விரும்புகிறீர்களா? இந்த செயலை மாற்ற முடியாது.

source: Bill deleted successfully
ta: பில் வெற்றிகரமாக நீக்கப்பட்டது

source: Failed to delete bill
ta: பில்லை நீக்குவதில் தோல்வி

# reviewAndSave
source: REVIEW & SAVE
ta: மதிப்பாய்வு & சேமி

# reviewAndFinalize
source: Review & Finalize
ta: மதிப்பாய்வு & இறுதி செய்

source: Bill Generated
ta: பில் உருவாக்கப்பட்டது

source: Bill Saved Successfully
ta: பில் வெற்றிகரமாக சேமிக்கப்பட்டது

# confirmAndGenerate
source: CONFIRM & GENERATE
ta: உறுதிப்படுத்து & உருவாக்கு

# invoiceGeneratedAndSaved
source: Invoice Generated & Saved Successfully!
ta: விலைப்பட்டியல் உருவாக்கப்பட்டு சேமிக்கப்பட்டது!

source: Invoice Updated Successfully!
ta: விலைப்பட்டியல் வெற்றிகரமாக புதுப்பிக்கப்பட்டது!

source: Failed to save invoice
ta: விலைப்பட்டியலைச் சேமிப்பதில் தோல்வி

# maxPaymentError
source: Max: {amount}
ta: அதிகபட்சம்: {amount}

source: Clear All Data?
ta: அனைத்து தரவையும் அழிக்கவா?

# clearAllDataConfirmation
source: This will reset all billing items and payment details. This action cannot be undone.
ta: இது அனைத்து பில்லிங் உருப்படிகள் மற்றும் பணம் செலுத்தும் விவரங்களை மீட்டமைக்கும். இந்த செயலை மாற்ற முடியாது.

source: BILL SUMMARY
ta: பில் சுருக்கம்

source: Advance Paid
ta: முன்பணம் செலுத்தப்பட்டது

source: PENDING
ta: நிலுவையில்

source: PARTIAL
ta: பகுதி

source: QTY
ta: எண்

source: TOT.LEN
ta: மொ.நீளம்

# defaultBusinessName
source: BUSINESS NAME
ta: வணிக பெயர்

# whatsappNumberHintExample
source: e.g., 9876543210
ta: உ.தா., 9876543210

# nameLabel
source: NAME
ta: பெயர்

# dateLabel
source: DATE
ta: தேதி

# phoneLabel
source: Phone
ta: மொபைல்

# descriptionShort
source: DESCRIPTION
ta: விவரம்

# lengthShort
source: LENGTH
ta: நீளம்

# qtyShort
source: QTY
ta: எண்

# totalLenShort
source: TOT.LEN
ta: மொ.நீளம்

# rateShort
source: RATE
ta: விலை

# totalShort
source: TOTAL
ta: மொத்தம்

# balanceDueUpper
source: BALANCE DUE
ta: மீதமுள்ள நிலுவை

# thankYouMessage
source: Thank you for your business!
ta: தங்கள் வருகைக்கு மிக்க நன்றி!

# billNumberPrefix
source: BILL #
ta: பில் #

# totalAmountCaps
source: TOTAL AMOUNT
ta: மொத்த தொகை

# initialPaymentNote
source: Initial payment for bill {number}
ta: பில் {number} -க்கான ஆரம்ப கட்டணம்

# failedToSaveInvoiceWithDetail
source: Failed to save invoice: {error}
ta: விலைப்பட்டியலைச் சேமிப்பதில் தோல்வி: {error}

# internetConnectionFailed
source: Internet connection failed. Please check your data or Wi-Fi connection and try again.
ta: இணைய இணைப்பு தோல்வியடைந்தது. உங்கள் தரவு அல்லது வைஃபை இணைப்பைச் சரிபார்த்து மீண்டும் முயற்சிக்கவும்.

# connectionTimeout
source: The connection timed out. Please try again when you have a better network.
ta: இணைப்பு நேரம் முடிந்தது. உங்களிடம் சிறந்த நெட்வொர்க் இருக்கும்போது மீண்டும் முயற்சிக்கவும்.

# cloudConnectionError
source: Could not connect to the cloud server. Please try again in a few minutes.
ta: மேகக்கணி சேவையகத்துடன் இணைக்க முடியவில்லை. இன்னும் சில நிமிடங்களில் மீண்டும் முயற்சிக்கவும்.

# paymentHistoryNote
source: Payment for Invoice #{number}
ta: விலைப்பட்டியல் #{number} க்கான கட்டணம்

# supabaseCredentialsMissing
source: Supabase credentials not found
ta: சப்போபேஸ் சான்றுகள் காணப்படவில்லை

# configureSupabaseMessage
source: Please configure your Supabase credentials in the app settings.
ta: தயவுசெய்து பயன்பாட்டு அமைப்புகளில் உங்கள் சப்போபேஸ் சான்றுகளை உள்ளமைக்கவும்.

source: Unknown error
ta: தெரியாத பிழை

source: Initializing backup...
ta: காப்புப்பிரதியைத் தொடங்குகிறது...

source: Backing up bills...
ta: பில்களை காப்புப்பிரதி எடுக்கிறது...

source: Backing up payments...
ta: கட்டணங்களை காப்புப்பிரதி எடுக்கிறது...

# fetchingBills
source: Fetching bills from cloud...
ta: கிளவுட்டிலிருந்து பில்களைப் பெறுகிறது...

# fetchingPayments
source: Fetching payments from cloud...
ta: கிளவுட்டிலிருந்து கட்டணங்களைப் பெறுகிறது...

# checkingDeleted
source: Checking for deleted records...
ta: நீக்கப்பட்ட பதிவுகளைச் சரிபார்க்கிறது...

# removingDeleted
source: Removing deleted records locally...
ta: நீக்கப்பட்ட பதிவுகளை உள்ளூரில் அகற்றுகிறது...

# restoringBill
source: Restoring bill {current}/{total}...
ta: பில்லை மீட்டமைக்கிறது {current}/{total}...

# restoringPayment
source: Restoring payment {current}/{total}...
ta: கட்டணத்தை மீட்டமைக்கிறது {current}/{total}...

source: Restoration completed!
ta: மீட்டமைப்பு முடிந்தது!

source: Backup completed!
ta: காப்புப்பிரதி முடிந்தது!

source: No internet connection
ta: இணைய இணைப்பு இல்லை

source: Supabase not initialized
ta: சப்போபேஸ் தொடங்கப்படவில்லை

# checkingConnectionProgress
source: Checking connection...
ta: இணைப்பைச் சரிபார்க்கிறது...

# backingUpBill
source: Backing up bill {current}/{total}...
ta: பில்லை காப்புப்பிரதி எடுக்கிறது {current}/{total}...

# backingUpPayment
source: Backing up payment {current}/{total}...
ta: கட்டணத்தை காப்புப்பிரதி எடுக்கிறது {current}/{total}...

# excelSyncSettings
source: Excel Report Settings
ta: எக்செல் அறிக்கை அமைப்புகள்

# enableExcelSync
source: Enable Weekly Excel Report
ta: வாராந்திர எக்செல் அறிக்கையை இயக்கு

# excelSyncDescription
source: Automatically export data to an Excel file in your Documents folder.
ta: உங்கள் ஆவணங்கள் கோப்புறையில் ஒரு எக்செல் கோப்பில் தரவை தானாகவே ஏற்றுமதி செய்யுங்கள்.

# syncFrequency
source: Export Frequency
ta: ஏற்றுமதி அதிர்வெண்

# everyDays
source: Every {days} days
ta: ஒவ்வொரு {days} நாட்களுக்கும்

# manualExcelSync
source: Manual Excel Export
ta: கைமுறை எக்செல் ஏற்றுமதி

# manualExcelSyncDescription
source: Export your data to an Excel file immediately.
ta: உங்கள் தரவை உடனடியாக ஒரு எக்செல் கோப்பில் ஏற்றுமதி செய்யுங்கள்.

source: Export Now
ta: இப்போது ஏற்றுமதி செய்

source: Exporting...
ta: ஏற்றுமதி செய்யப்படுகிறது...

# excelSyncStatus
source: Excel Export Status
ta: எக்செல் ஏற்றுமதி நிலை

# lastExport
source: Last export: {time}
ta: கடைசி ஏற்றுமதி: {time}

# noExportHistory
source: No export history available
ta: ஏற்றுமதி வரலாறு இல்லை

# excelExportSuccess
source: Excel Export Successful
ta: எக்செல் ஏற்றுமதி வெற்றி

# excelExportSuccessMessage
source: Data exported to Documents/FurnitureBillingData
ta: Documents/FurnitureBillingData இல் தரவு ஏற்றுமதி செய்யப்பட்டது

source: Excel Export Failed
ta: எக்செல் ஏற்றுமதி தோல்வி
